////////////////////// เปิดใช้งาน เซอร์โว(Servo)บรรทัดที่ 20,21,22 //////////////////

 ////////////////////////////// ** MENU **  /////////////////////////////////

void menu2()   /// code 2 ที่นี่

{


 
}

///////////////////////////////////////////////////////////////////
void menu3()   /// code 3 ที่นี่

{



}

//////////////////////////////////////////////////////////////////
void menu4()   /// code 4 ที่นี่

{


BD(2000);

 
}

//////////////////////////////////////////////////////////////////
void menu5()   /// code 5 ที่นี่

{

UP();delay(1000);DOWN();

}

////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////

//   int fl = ความเร็วมอเตอร์ข้างซ้าย;
//   int fr = ความเร็วมอเตอร์ข้างขวา;
//   FT();        //เดินหน้า ==ถ้าเซนเซอร์ S1 เจอดำ หยุดและถอยหลังมากลางช่อง==
//   FF(เวลา);    //เดินหน้า==กรณีที่จุด start เป็นพื้นที่ที่เซ็นเซอร์ไม่สามารถวัดค่าแบบตายตัวได้
//   FD(เวลา);    //เดินหน้า==โดยใช้เซนเซอร์จนกว่าจะหมดเวลา
//   FPP();       //เดินหน้า==ถ้าเซนเซอร์ทั้ง 3 ตัวเจอดำ หยุดนิ่ง เพื่อที่จะทิ้งถุงยังชีพ==
//   LD(เวลา);    //เลี้ยวซ้าย==โดยไม่สนเซ็นเซอร์แต่ใช้การกำหนดเวลา
//   RD(เวลา);    //เลี้ยวขวา==โดยไม่สนเซ็นเซอร์แต่ใช้การกำหนดเวลา
//   B();         //ถอยหลัง==โดยใช้เซนเซอร์ 2 ตัวข้างหลัง
//   BD(เวลา);    //ถอยหลัง==เรื่อยๆจนกว่าจะหมดเวลา
//   paste();     //ทิ้งถุงยังชีพ
//   UP();        //ขึ้น
//   DOWN();      //ลง
//   delay(เวลา); //หน่วงเวลา
////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////
