////////////////////// เปิดใช้งาน เซอร์โว(Servo)บรรทัดที่ 20,21,22 //////////////////
/////////////ตัวแปรเก็บค่าความเร็วเดินหน้า 
int fl = 100;   //ล้อซ้าย
int fr = 100;   //ล้อขวา

/////////////ตัวแปรเก็บค่าความเร็วถอยหลัง
int bl = -100;  //ล้อซ้าย
int br = -100;  //ล้อขวา

//////////////ค่ากลางเซนเซอร์  เอาไว้เปรียบเทียบค่าแสง/////////

int cen0 = 450;   //ค่ากลาง เซ็นเซอร์ S0
int cen1 = 450;   //ค่ากลาง เซ็นเซอร์ S1
int cen2 = 450;   //ค่ากลาง เซ็นเซอร์ S2
int cen3 = 450;   //ค่ากลาง เซ็นเซอร์ S3
int cen4 = 450;   //ค่ากลาง เซ็นเซอร์ S4

/////////////////////// องศา เซอร์โว /////////////////////////////

const int v_standby = 275 ;      //กำหนดค่ายกมือลง servo 1

const int v_go = 5;    //กำหนดค่ายกมือขึ้น servo 1

///////////////////////////////////////////////////////////////////

void sv_set()   // เซตเซอร์โว

{sv1.write(275);} // ค่าองศาเซอร์โวตอนเปิดบอร์ด....ยกมือลง

//////////////////////////////////////////////////////////////////

void T() //ตัวหลักสำหรับแก้ความเร็วบนเส้นทางท้งหมด

{
  analogs();    

  if ((S0 > cen0) and (S2 > cen2)) {run(fl,fr);}

    if (S0 < cen0) {run(100, -100);}

    if (S2 < cen2) {run(-100, 100);}}

////////////////////////////////////////////////////////////////////

void FT() //เดินหน้า==ถ้าเซนเซอร์ S1 เจอดำ หยุดและถอยหลังมากลางช่อง==

{while (1){

  T();

  if (S1 < cen1)
  {
//    FPP();delay(400);
    run(-100,-100); delay(400);

       run(0,0); delay(100); break;}}}

////////////////////////////////////////////////////////////////////

void FF(int T)  //เดินหน้า=กรณีที่จุด start เป็นพื้นที่ที่เซ็นเซอร์ไม่สามารถวัดค่าแบบตายตัวได้
{ 
 run(fl,fr);delay(T); run(0,0); delay(10);  
}

////////////////////////////////////////////////////////////////////

void FD(int times) //เดินหน้า=โดยใช้เซนเซอร์จนกว่าจะหมดเวลา

{int i=0;

  while (1){

  T();

  if (i>times){run(0,0); delay(500);  break;}

  i++;

    }}

////////////////////////////////////////////////////////////////////

void FPP() //เดินหน้า ==ถ้าเซนเซอร์ทั้ง 3 ตัวเจอดำ หยุดนิ่ง เพื่อที่จะทิ้งถุงยังชีพ==

{while (1){

  T();

  if ((S0 > cen0) and (S2 > cen2)) {run(fl,fr);}

    if (S0 < cen1) {run(-100,100);}

    if (S2 < cen2) {run(100,-100);}

    if ((S0 < cen0) and (S2 < cen2)) {run(0,0); break;}}
    
    }

////////////////////////////////////////////////////////////////////

void LD(int T) { //เลี้ยวซ้ายโดยไม่สนเซ็นเซอร์แต่ใช้การกำหนดเวลา

 run(-170,170);delay(T); run(0,0); delay(10); }

////////////////////////////////////////////////////////////////////

void RD(int T) { //เลี้ยวขวาโดยไม่สนเซ็นเซอร์แต่ใช้การกำหนดเวลา

 run(170,-170);delay(T); run(0,0); delay(10); }
 

////////////////////////////////////////////////////////////////////  

void B() //ถอยหลัง==โดยใช้เซนเซอร์ 2 ตัวข้างหลัง
{while(1){

  analogs();    

  if ((S3 > cen3) and (S4 > cen4)) {run(bl,br);}

    if (S3 < cen3) {run(100, -100);}

    if (S4 < cen4) {run(-100, 100);}

    if ((S3 < cen3) and (S4 < cen4)) {run(0,0);delay(100);
    
    run(100,100);delay(200);
    
    run(0,0);delay(100); break;}}}

////////////////////////////////////////////////////////////////////

void BD(int T) { //ถอยหลัง เรื่อยๆจนกว่าจะหมดเวลา

 run(bl,br);delay(T); run(0,0); delay(10);  }

////////////////////////////////////////////////////////////////////

void paste() //ทิ้งถุงยังชีพ==
{

sv1.write(v_go);delay(500);

sv1.write(v_standby);delay(700); 

}
////////////////////////////////////////////////////////////////////
void UP() //ยก==
{

sv1.write(v_go);delay(2000);

}
////////////////////////////////////////////////////////////////////
void DOWN() //ลง==
{

sv1.write(v_standby);delay(1000);

}
////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////

//   int fl = ความเร็วมอเตอร์ข้างซ้าย;
//   int fr = ความเร็วมอเตอร์ข้างขวา;
//   FT();    //เดินหน้า ==ถ้าเซนเซอร์ S1 เจอดำ หยุดและถอยหลังมากลางช่อง==
//   FF(เวลา); //เดินหน้า==กรณีที่จุด start เป็นพื้นที่ที่เซ็นเซอร์ไม่สามารถวัดค่าแบบตายตัวได้
//   FD(เวลา); //เดินหน้า==โดยใช้เซนเซอร์จนกว่าจะหมดเวลา
//   FPP();   //เดินหน้า==ถ้าเซนเซอร์ทั้ง 3 ตัวเจอดำ หยุดนิ่ง เพื่อที่จะทิ้งถุงยังชีพ==
//   LD(เวลา); //เลี้ยวซ้าย==โดยไม่สนเซ็นเซอร์แต่ใช้การกำหนดเวลา
//   RD(เวลา); //เลี้ยวขวา==โดยไม่สนเซ็นเซอร์แต่ใช้การกำหนดเวลา
//   B();      //ถอยหลัง==โดยใช้เซนเซอร์ 2 ตัวข้างหลัง
//   BD(เวลา); //ถอยหลัง==เรื่อยๆจนกว่าจะหมดเวลา
//   paste();  //ทิ้งถุงยังชีพ
//   UP();        //ขึ้น
//   DOWN();      //ลง
//   delay(เวลา); //หน่วงเวลา
////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////
