////////////////////// เปิดใช้งาน เซอร์โว(Servo)บรรทัดที่ 20,21,22 //////////////////
/////////////ตัวแปรเก็บค่าความเร็วเดินหน้า 
uint8_t fl = 100;   //ล้อซ้าย
uint8_t fr = 100;   //ล้อขวา

/////////////ตัวแปรเก็บค่าความเร็วถอยหลัง
uint8_t bl = 100;  //ล้อซ้าย
uint8_t br = 100;  //ล้อขวา

///////////////// ตั้งค่าความเร็วการสบัด  /////////////////////////////////////////
////////////ตัวแปรเก็บค่าความเร็วกันหลุด ไปข้างหน้า
uint8_t mfl = 100;   //ล้อซ้าย
uint8_t mfr = 100;   //ล้อขวา

////////////ตัวแปรเก็บค่าความเร็วกันหลุด ไปข้างหลัง
uint8_t mbl = 100;   //ล้อซ้าย
uint8_t mbr = 100;   //ล้อขวา


//////////////ค่ากลางเซนเซอร์  เอาไว้เปรียบเทียบค่าแสง/////////

int cen0 = 450;   //ค่ากลาง เซ็นเซอร์ S0
int cen1 = 450;   //ค่ากลาง เซ็นเซอร์ S1
int cen2 = 450;   //ค่ากลาง เซ็นเซอร์ S2
int cen3 = 450;   //ค่ากลาง เซ็นเซอร์ S3
int cen4 = 450;   //ค่ากลาง เซ็นเซอร์ S4

/////////////////////// องศา เซอร์โว /////////////////////////////

uint8_t v_standby = 275 ;      //กำหนดค่ายกมือลง servo 1
uint8_t v_go = 5;    //กำหนดค่ายกมือขึ้น servo 1


////////////////////////////// ** MENU **  /////////////////////////////////

void menu2()   /// code 2 ที่นี่
{

  test_motor();
 
}

///////////////////////////////////////////////////////////////////
void menu3()   /// code 3 ที่นี่
{



}

//////////////////////////////////////////////////////////////////
void menu4()   /// code 4 ที่นี่
{
 


}

//////////////////////////////////////////////////////////////////
void menu5()   /// code 5 ที่นี่
{



}

////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////

//   int fl = ความเร็วมอเตอร์ข้างซ้าย;
//   int fr = ความเร็วมอเตอร์ข้างขวา;

//   FT();        , FT(ความเร็ว);        //เดินหน้า ==ถ้าเซนเซอร์ S1 เจอดำ หยุดและถอยหลังมากลางช่อง==
//   FF(เวลา);    , FF(เวลา,ความเร็ว);    //เดินหน้า==กรณีที่จุด start เป็นพื้นที่ที่เซ็นเซอร์ไม่สามารถวัดค่าแบบตายตัวได้
//   FD(เวลา);    , FD(เวลา,ความเร็ว);    //เดินหน้า==โดยใช้เซนเซอร์จนกว่าจะหมดเวลา
//   FPP();       , FPP(ความเร็ว);       //เดินหน้า==ถ้าเซนเซอร์ทั้ง 3 ตัวเจอดำ หยุดนิ่ง เพื่อที่จะทิ้งถุงยังชีพ==
//   LD(เวลา);    ,  LD(ความเร็ว,เวลา);   //เลี้ยวซ้าย==โดยไม่สนเซ็นเซอร์แต่ใช้การกำหนดเวลา
//   RD(เวลา);    ,  RD(ความเร็ว,เวลา);   //เลี้ยวขวา==โดยไม่สนเซ็นเซอร์แต่ใช้การกำหนดเวลา
//   B();         ,  B(เวลา,ความเร็ว);        //ถอยหลัง==โดยใช้เซนเซอร์ 2 ตัวข้างหลัง
//   BD(เวลา);     , BD();//ถอยหลัง==เรื่อยๆจนกว่าจะหมดเวลา

//   paste();     //ทิ้งถุงยังชีพ
//   UP();        //ขึ้น
//   DOWN();      //ลง
//   delay(เวลา); //หน่วงเวลา
////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////
